'''
ToDo:
- додайте функцію валідації телефонного номера, яка буде перевіряти чи номер телефону відповідає формату +380XXXXXXXXX, де X - це цифра від 0 до 9. Якщо номер телефону не відповідає цьому формату, функція повинна виводити повідомлення про помилку.
- додайте функцію валідації електронної пошти, яка буде перевіряти чи електронна пошта відповідає формату
'''

def validate_phone_number(phone_number: str) -> str:
    """Повертає телефонний номер, якщо його можна вважати валідним або повертає помилку
    Args:
    phone_number (str): телефонний номер у форматі +380XXXXXXXXX
    Returns:
        str: телефонний номер, якщо він валідний
    Raises:
        ValueError: якщо телефонний номер не відповідає формату +380XXXXXXXXX
    """
    return phone_number

def validate_email(email: str) -> str:
    """Повертає електронну пошту, якщо її можна вважати валідною або повертає помилку
    Args:
    email (str): електронна пошта у форматі user@example.com
    Returns:
        str: електронна пошта, якщо вона валідна
    Raises:
        ValueError: якщо електронна пошта не відповідає формату user@example.com
    """
    return email